// Определить количество цифр в числе

Console.Clear();
System.Console.WriteLine("Введите любое число");
string s;
int count=0;
s= Console.ReadLine();
count = s.Length;


Console.WriteLine("В вашем числе цифр "+ count);
